TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_СостоянияРегистрации/гкс_СостоянияРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_СостоянияРегистрации</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.гкс_СостоянияРегистрации</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>МестнаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипРегистрации</name>
    <type>
      <types>EnumRef.гкс_ТипРегистрации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРегистрации</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ВремяНахожденияТСНаПЛК/гкс_ВремяНахожденияТСНаПЛК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ВремяНахожденияТСНаПЛК</name>
  <resources>
    <name>ВремяВзвешенБрутто</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ВремяВзвешенТара</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьОтклонение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Отклонение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяНаПЛК</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументРегистрации</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипыПроб/гкс_ТипыПроб.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипыПроб</name>
  <enumValues>
    <name>Единичная</name>
  </enumValues>
  <enumValues>
    <name>Композитная</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_СостоянияРегистрации/гкс_СостоянияРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_СостоянияРегистрации</name>
  <enumValues>
    <name>Прибыл</name>
  </enumValues>
  <enumValues>
    <name>ВзвешенБрутто</name>
  </enumValues>
  <enumValues>
    <name>НеПринятоПоПревышениюМаксимальногоВеса</name>
  </enumValues>
  <enumValues>
    <name>Регистрация</name>
  </enumValues>
  <enumValues>
    <name>ГотовКОтборуПроб</name>
  </enumValues>
  <enumValues>
    <name>ВзятыПробы</name>
  </enumValues>
  <enumValues>
    <name>РезультатыПробПолучены</name>
  </enumValues>
  <enumValues>
    <name>КачествоПринято</name>
  </enumValues>
  <enumValues>
    <name>КачествоНеПринято</name>
  </enumValues>
  <enumValues>
    <name>ВыгрузкаРазрешена</name>
  </enumValues>
  <enumValues>
    <name>Выгружен</name>
  </enumValues>
  <enumValues>
    <name>ВзвешенТара</name>
  </enumValues>
  <enumValues>
    <name>Убыл</name>
  </enumValues>
  <enumValues>
    <name>НеПринято</name>
  </enumValues>
  <enumValues>
    <name>ПринятыПробы</name>
  </enumValues>
  <enumValues>
    <name>ПогрузкаРазрешена</name>
    <comment>ERP-2029</comment>
  </enumValues>
  <enumValues>
    <name>Погружен</name>
    <comment>ERP-2029</comment>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_РегистрацияНаПЛК/гкс_РегистрацияНаПЛК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_РегистрацияНаПЛК</name>
  <basedOn>Document.гкс_ВъездНаКПП</basedOn>
  <registerRecords>AccumulationRegister.гкс_СДИЗНаПЛК</registerRecords>
  <attributes>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесБрутто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесНетто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесТары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>DocumentRef.гкс_СпецификацияКДоговоруКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительПолучатель</name>
    <comment>Для приёмки Грузоотправитель, для отправки Грузополучатель</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаПоставщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокументаПоставщика</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Внутригрупповой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Собственник</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>МестнаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРегистрации</name>
    <type>
      <types>EnumRef.гкс_ТипРегистрации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаВъезда</name>
    <comment>Точка маршрута для определения проезда</comment>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDEPC</name>
    <type>
      <types>DefinedType.RFIDEPC</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDTID</name>
    <type>
      <types>DefinedType.RFIDTID</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ИДРейса</name>
    <comment>ERP-2176</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияВеса</name>
    <comment>Ед.измерения веса в документе</comment>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЗоныКарантинногоКонтроля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЗоныКарантинногоКонтроляСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесоваяВъезда</name>
    <type>
      <types>CatalogRef.гкс_СтруктураПЛК</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеПроезда</name>
    <type>
      <types>CatalogRef.гкс_УсловияПроезда</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПогрузки</name>
    <type>
      <types>CatalogRef.гкс_СтруктураПЛК</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаОтгрузкуПродукции</name>
    <type>
      <types>DocumentRef.гкс_ЗаявкаНаОтгрузкуПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгрузкаСОдногоБорта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.гкс_ПрибытиеСуднаНаПЛК</types>
      <types>DocumentRef.гкс_ЗаписьВОчередьПриемкиПЛК</types>
      <types>DocumentRef.гкс_ВъездНаКПП</types>
      <types>DocumentRef.гкс_СРПВПрибытиеНаПуть</types>
    </type>
  </attributes>
  <attributes>
    <name>СДИЗ</name>
    <type>
      <types>CatalogRef.гкс_СДИЗЗЕРНО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктПогрузки</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокументаОснования</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </attributes>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_ФормированиеНомераПробы/гкс_ФормированиеНомераПробы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_ФормированиеНомераПробы</name>
  <attributes>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПробы</name>
    <type>
      <types>EnumRef.гкс_ТипыПроб</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПробы</name>
    <type>
      <types>CatalogRef.гкс_НомерПробы</types>
    </type>
  </attributes>
  <attributes>
    <name>МестнаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныеСуткиРегистрации</name>
    <comment>ERP-1431</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокРегистраций</name>
    <attributes>
      <name>ДокументРегистрации</name>
      <type>
        <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/CommonModules/гкс_ПриемкаТранспортаСлужубныйВызовСервера/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Проверяет что все переданные регистрации находятся допустимых состояниях. 
// 
// Параметры:
//  ВыбранныеРегистрации - Массив из ДокументСсылка.гкс_РегистрацияНаПЛК - проверяемые документы
//  ВалидныеСостояния - Массив из ПеречислениеСсылка.гкс_СостоянияРегистрации - допустимые состояния
//  ВыводитьСообщения - Булево - Выводить сообщения
// 
// Возвращаемое значение:
//  Булево - Истина если все переданные регистрации находятся допустимых состояниях.
Функция ПроверитьСостояниеРегистраций(ВыбранныеРегистрации, ВалидныеСостояния, ВыводитьСообщения = Ложь) Экспорт
	
	Результат = Ложь;
	СтрокиСообщения = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивРегистраций", ВыбранныеРегистрации);
	Запрос.УстановитьПараметр("Состояния", ВалидныеСостояния);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СостоянияРегистрацииСрезПоследних.ДокументРегистрации КАК ДокументРегистрации,
	|	СостоянияРегистрацииСрезПоследних.Состояние КАК Состояние,
	|	СостоянияРегистрацииСрезПоследних.ТранспортноеСредство КАК ТранспортноеСредство,
	|	ВЫБОР
	|		КОГДА СостоянияРегистрацииСрезПоследних.Состояние В (&Состояния)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоКорректноеСостояние
	|ИЗ
	|	РегистрСведений.гкс_СостоянияРегистрации.СрезПоследних(, ДокументРегистрации В (&МассивРегистраций)) КАК
	|		СостоянияРегистрацииСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭтоКорректноеСостояние УБЫВ
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Состояние)
	|ПО
	|	ЭтоКорректноеСостояние";
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ЭтоКорректноеСостояние Тогда
			
			// проверка на один вид состояния в выборке
			Результат = ?(Выборка.Состояние = 1, Истина, Ложь);
			Если Не Результат Тогда
				СтрокиСообщения.Добавить(
					НСтр("ru = 'Выбраны регистрации в разных состояниях!
						 |Необходимо выбрать регистрации с одним состоянием.'"));
			КонецЕсли;
			
		Иначе
			
			ПодготовитьСтрокиСообщенияДляНекорректногоСостоянияРегистрации(Выборка, СтрокиСообщения);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ВыводитьСообщения 
		И СтрокиСообщения.Количество() > 0 Тогда
		ТекстСообщения = СтрСоединить(СтрокиСообщения, Символы.ПС);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает список регистраций помеченных для групповой обработки
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма, в которой выполняется команда.
//   
//	Возвращаемое значение:
//		Массив из ДокументСсылка.гкс_РегистрацияНаПЛК
Функция РегистрацииГрупповойОбработки(Форма) Экспорт

	Элементы = Форма.Элементы;
	Настройки = Элементы.СписокРегистрации.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	ИсполняемаяСхема = Элементы.СписокРегистрации.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	Попытка
		МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(ИсполняемаяСхема,
			Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"), Ложь);
	Исключение
		
		ИнформацияОбОшибке 		= ИнформацияОбОшибке();
		СообщениеОбОшибке 		= ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		КраткоеОписаниеОшибки 	= ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		
		ЗаписьЖурналаРегистрации(
			"АРМ Приемка транспорта",
			УровеньЖурналаРегистрации.Ошибка,,,
			СообщениеОбОшибке);
		
		ЧастиСообщения = Новый Массив;
		ЧастиСообщения.Добавить(НСтр("ru = 'Не удалось получить регистрации групповой обработки!'"));
		ЧастиСообщения.Добавить(СтрШаблон(НСтр("ru = 'Причина: %1'"), КраткоеОписаниеОшибки));
		ТекстОшибки = СтрСоединить(ЧастиСообщения, Символы.ПС);
		
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		Возврат Неопределено;
		
	КонецПопытки;
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, , , Истина);
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Возврат ТаблицаРезультат.ВыгрузитьКолонку("ДокументРегистрации");
	
КонецФункции

// Проверяет возможность создания направлений на разгрузку для списка регистраций.
// 
// Параметры:
//  ВыбранныеРегистрации - Массив из ДокументСсылка.гкс_РегистрацияНаПЛК - проверяемые документы.
// 
// Возвращаемое значение:
//  Булево - Истина если для всех выбранных регистраций доступно создание направления на разгрузку.
Функция КонтрольПрохожденияНеобходимыхСтатусов(ВыбранныеРегистрации) Экспорт
	
	Результат = Истина;	
	
	Для Каждого ДокументРегистрации Из ВыбранныеРегистрации Цикл
		
		Если Не гкс_ПриемкаТранспорта.НаправлятьНаРазгрузкуРазрешение(ДокументРегистрации) Тогда
			
			Результат = Ложь;
			ТранспортноеСредствоРегистрации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
				ДокументРегистрации, "ТранспортноеСредство");
			
			ТекстСообщения = СтрШаблон(НСтр("ru='Транспорт %1 не готов для направления на разгрузку:
				|	%2'"), ТранспортноеСредствоРегистрации, ДокументРегистрации);
				
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что в переданных регистрациях указана одинаковая номенклатура и возвращает ее. 
// Если номенклатур больше, чем одна, метод выводит сообщение пользователю.
// 
// Параметры:
//  ВыбранныеРегистрации - Массив из ДокументСсылка.гкс_РегистрацияНаПЛК - проверяемые документы
// 
// Возвращаемое значение:
//  Неопределено, СправочникСсылка.Номенклатура - Номенклатура регистраций
Функция НоменклатураРегистраций(ВыбранныеРегистрации) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокРегистраций", ВыбранныеРегистрации);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РегистрацияНаПЛК.Номенклатура КАК Номенклатура
	|ИЗ
	|	Документ.гкс_РегистрацияНаПЛК КАК РегистрацияНаПЛК
	|ГДЕ
	|	РегистрацияНаПЛК.Ссылка В (&СписокРегистраций)
	|СГРУППИРОВАТЬ ПО
	|	РегистрацияНаПЛК.Номенклатура";
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Результат = Выборка.Номенклатура;
	Иначе
		ТекстСообщения = НСтр(
			"ru='В выбранных строках разная номенклатура! Не возможно применить групповую операцию.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);

		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ДополнитьПараметрыОткрытияЛабАнализа(ДокументРегистрации, ПараметрыОткрытия) Экспорт
		
	ЛабАнализРегистрации = гкс_ПриемкаТранспорта.ОпределитьЛабораторныйАнализ(ДокументРегистрации);
	
	Если ЗначениеЗаполнено(ЛабАнализРегистрации) Тогда
		ПараметрыОткрытия.Вставить("Ключ", ЛабАнализРегистрации);
		ПараметрыОткрытия.Вставить("ИзАРМа", Истина);
	КонецЕсли;
	
	ДополнительныеПараметры = гкс_ПриемкаТранспортаКлиентСервер.ДополнительныеПараметрыДляПробыПриняты(
		ДокументРегистрации);
	ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", ДополнительныеПараметры);
	
КонецПроцедуры

Функция ФормированияПробПоРегистрациям(ВыбранныеРегистрации) Экспорт
	
	МенеджерДокумента = Документы.гкс_ФормированиеНомераПробы;
	МассивОбъектов = Новый Массив;
	Для Каждого ДокументРегистрации Из ВыбранныеРегистрации Цикл 
		
		ДокументФормированиеНомераПробы = МенеджерДокумента.ДокументПоРегистрацииТипуПробы(
			ДокументРегистрации, Перечисления.гкс_ТипыПроб.Единичная);
		
		Если ЗначениеЗаполнено(ДокументФормированиеНомераПробы) Тогда
			МассивОбъектов.Добавить(ДокументФормированиеНомераПробы);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивОбъектов;
	
КонецФункции

Функция ДоступноПодтверждениеРазгрузки(Регистрация) Экспорт
	
	НаправлениеНаРазгрузку = гкс_ПриемкаТранспорта.НаправлениеНаРазгрузкуПоРегистрации(Регистрация);
	Если Не ЗначениеЗаполнено(НаправлениеНаРазгрузку) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РеквизитыНаправления = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		НаправлениеНаРазгрузку, "СлужебнаяНоменклатура,Склад,ЯмаРазгрузки");
		
	Возврат ЗначениеЗаполнено(РеквизитыНаправления.СлужебнаяНоменклатура)
		И ЗначениеЗаполнено(РеквизитыНаправления.Склад)
		И ЗначениеЗаполнено(РеквизитыНаправления.ЯмаРазгрузки);
		
КонецФункции

Функция ЕстьКомментарийОтклоненияПогрузки(ДокументРегистрации) Экспорт
	
	ДанныеВремениПогрузки =
		РегистрыСведений.гкс_ВремяНахожденияТСНаПЛК.ДанныеПоВремениНахожденияНаПЛК(ДокументРегистрации);
	Возврат 
		ЗначениеЗаполнено(ДанныеВремениПогрузки.Комментарий);
	
КонецФункции

Функция ВыполнитьСозданиеНомеровПробНаСервере(ВыбранныеРегистрации, ОтборТочкаМаршрута) Экспорт
	
	МестнаяДата = Справочники.гкс_ТочкиМаршрута.ПолучитьМестнуюДатуПоТочкеМаршрута(ОтборТочкаМаршрута);
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Дата",				ТекущаяДатаСеанса());
	ЗначенияЗаполнения.Вставить("ТочкаМаршрута",	ОтборТочкаМаршрута);
	ЗначенияЗаполнения.Вставить("ТипПробы", 		Перечисления.гкс_ТипыПроб.Единичная);
	ЗначенияЗаполнения.Вставить("МестнаяДата", 		МестнаяДата);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.Вставить("ОжидатьЗавершение", Неопределено);
	ПараметрыВыполнения.Вставить("ЗапуститьНеВФоне", Истина);
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения,
		"Обработки.гкс_ПриемкаТранспорта.ГрупповоеСозданиеНомеровПроб",
		ЗначенияЗаполнения, ВыбранныеРегистрации);
			
КонецФункции

Функция НаправлятьНаРазгрузкуРазрешение(Регистрация) Экспорт
	
	Возврат гкс_ПриемкаТранспорта.НаправлятьНаРазгрузкуРазрешение(Регистрация);
	
КонецФункции

Функция ВыполнитьПропускКонтроляКачестваНаСервере(ВыбранныеРегистрации) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.Вставить("ОжидатьЗавершение", Неопределено);
	ПараметрыВыполнения.Вставить("ЗапуститьНеВФоне", Истина);
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения,
		"Обработки.гкс_ПриемкаТранспорта.ЗарегистрироватьПропуcкКонтроляКачества",
		ВыбранныеРегистрации);
		
КонецФункции

Процедура ОтклонитьРегистрациюНаСервере(Комментарий, МассивРегистрации) Экспорт
	
	Менеджер = Обработки.гкс_ПриемкаТранспорта;	
	Для Каждого ДанныеРегистрации Из МассивРегистрации Цикл
		
		ДополнитьКомментарийОтклоненияРегистрации(Комментарий, ДанныеРегистрации.ТранспортныйДокумент);
		Менеджер.ВыполнитьУдалениеСвязиРегистрацииИТранспортногоДокумента(ДанныеРегистрации.ДокументРегистрации);
		
		ЗарегистрироватьНовоеСостояние(
			Перечисления.гкс_СостоянияРегистрации.НеПринято, ДанныеРегистрации.ДокументРегистрации, Комментарий);
			
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗарегистрироватьНовоеСостояние(НовоеСостояние, ДокументРегистрации, Комментарий = "") Экспорт
	
	гкс_ПриемкаТранспорта.ЗарегистрироватьНовоеСостояние(ДокументРегистрации, НовоеСостояние, Комментарий);
	
КонецПроцедуры

Функция ВыполнитьПробыПринятыНаСервере(ВыбранныеРегистрации) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.Вставить("ОжидатьЗавершение", Неопределено);
	ПараметрыВыполнения.Вставить("ЗапуститьНеВФоне", Истина);
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения,
		"Обработки.гкс_ПриемкаТранспорта.ЗарегистрироватьНовоеСостояниеПоСписку",
		ВыбранныеРегистрации, Перечисления.гкс_СостоянияРегистрации.ПринятыПробы);
			
КонецФункции

Процедура РедактироватьПриемкуНаСервере(ПараметрыРедактирования, ДокументРегистрации, ДанныеРегистрации) Экспорт
	
	гкс_ПриемкаТранспортаСлужебный.РедактироватьПриемкуНаСервере(
		ПараметрыРедактирования, ДокументРегистрации, ДанныеРегистрации);
	
КонецПроцедуры

Функция НаправлениеНаРазгрузкуПоРегистрации(Регистрация) Экспорт
	
	Возврат гкс_ПриемкаТранспорта.НаправлениеНаРазгрузкуПоРегистрации(Регистрация);
	
КонецФункции

Функция СлужебнаяНоменклатураДляФормированияНаправленияНаРагрузку(ЛабораторныйАнализ) Экспорт
	
	Возврат 
		гкс_ПриемкаТранспортаСлужебный.СлужебнаяНоменклатураДляФормированияНаправленияНаРагрузку(ЛабораторныйАнализ);
	
КонецФункции

Функция ТекущийКомпозитныйАнализНеПройденПоКачеству(ДокументРегистрации, СостояниеКачества) Экспорт
	
	Возврат 
		гкс_ВходнойКонтрольКачества.ТекущийКомпозитныйАнализНеПройденПоКачеству(
			ДокументРегистрации, СостояниеКачества);
			
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПодготовитьСтрокиСообщенияДляНекорректногоСостоянияРегистрации(Выборка, СтрокиСообщения)
	
	СтрокиСообщения.Добавить(НСтр("ru = 'Несоответствующее состояние документа для проведения операции:'"));
	ВыборкаДетальныеЗаписи = Выборка.Выбрать();	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокиСообщения.Добавить(
			СтрШаблон("%1, %2, %3",
				ВыборкаДетальныеЗаписи.ДокументРегистрации,
				ВыборкаДетальныеЗаписи.Состояние,
				ВыборкаДетальныеЗаписи.ТранспортноеСредство));
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьКомментарийОтклоненияРегистрации(Комментарий, ТранспортныйДокумент)
	
	ТекстПользователя = Комментарий;
	ТекДата = ТекущаяДатаСеанса();
	
	Если ЗначениеЗаполнено(ТранспортныйДокумент) Тогда
		ШаблонКомментария = НСтр("ru='%1 : %2. Дата отклонения: %3'");
		Комментарий = СтрШаблон(ШаблонКомментария, ТранспортныйДокумент, 
			ТекстПользователя, ТекДата);
	Иначе
		ШаблонКомментария = НСтр("ru='%1. Дата отклонения: %2'");
		Комментарий = СтрШаблон(ШаблонКомментария, ТекстПользователя, ТекДата);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
